{
  "timestamp": "20251123_233049",
  "text": "상담 대항창회가 똑같이 텍스와 문장을 되게끔 명절이 돼 있는거야 지금 나 집중이 다 보여줄게 그건 안 해놨어 그건 아닌데 할 계획인거야 지금 그치? 이 부분은 내가 다음 주에 문장 완성시키고 그걸 하면서 연동을 시켜볼게 네 근데 죄송해요 많은데 지금 살짝 고민이 있는데 봐봐 여기서 내 마우스보여? 응 어, 아니면 아래서도 편집을 할 수가 있고 여기서 음답 전송을 보내면은 응 여기에 떠야 되는 거잖아 응 근데 여기도 메시지를 입력하세요가 있다? 그러면 지워야겠네 이거 아, 근데 그냥 이걸 두 번째 방법이라고 할까? 수원 인식이나 넷터그 그러면은 필담이랑 타이핀이랑 수원 인식이 세 가지네? 응 그러면 제스니 필담은 어 이거 제서기가 할 일이 있어 응? 제서기가 지금 혹시 정면 걸 잘하니까 좀 정리를 해줄 수 있어? 패드에다가 아, 내가 노샤맨도 써놓을게 그러니까 어쨌든 우리가 화면 나도 좀 더 화면을 보여줄 텐데 응 화면에 대해서 조금 얘기를 해봐야 될 걸 이태희한테 전달을 해줘야 되잖아? 응 어? 어때? 별로야? 희정 생각 그럼 지금 하고 있다는 거 아니야? 타이핀 하고 있으면 내가 응 응, 하고 있지 내가 할게 그래서 그냥 결론적으로 세 가지야 여기에서 수원 인식 여기에서 타이핀 그리고 만약에 할머니 할아버지면 키보드 치는 거나 그런 거 불편할 거 아니야 응 그러면은 뭐 필담까지 그, 그럼 필담은 이미 태블릿 자체의 내장이 돼 있으니까 그 방식으로 할 수 있습니다 라고 해결 근데 너무 하는 거 어떻게 생각해? 응 너무 UI적으로 너무 많지 않아? 음 필담은 여기도 안 놓을 거야 필담은 원래 있는 그거잖아 그건데 여기서 두 개 추가되는 거 아니야? 우리의 서비스 응 아 그렇네 그러면 그거 우리의 서비스가 아닌가? 어 원래 한 가지 선택지였는데 거기서 두 가지를 우리가 더 준다고 제공한다고 이렇게 이끼러 왔어 어 그래 제작이 그 말 잘했다 그렇게 해야겠다 그러면 그리고 희정아 너 원래 수원 인식 카메라를 가운데에 배치하고 싶다고 했잖아 응 근데 응 손보다 커졌어 그래? 근데 해보니까 막 불편하진 않더라고 이게 딱 보면은 화면은 딱 절반을 나타내거든? 응 그래서 막 불편함을 느끼지는 않아서 그냥 유지할까 싶기도 하고 절대 귀찮은 건 아니야 아니 그러면 저 화면 화면 이거 봐봐 화면에서 음 그 메세지 입력하세요를 기본 값으로 두지 말고 상남 대화창만 그 서로 대화창만 뜨게 한 다음에 필담을 하고 싶으면 버튼을 눌러서 메세지를 입력하세요가 뜨게 하게 끊면 어때? 백앤드가 너무 어려워 들려나? 응 지금 손으로 간다 아니 그러니까 내가 생각했으면 이대로 해도 괜찮은 것 같긴 한데 크게 막 디자인이 중요하지 않으니까 그 UI적으로 너무 뭐가 좋아진 생각으로는? 응 그니까 이 수어를 인식하면 여기 질문, 응답 옆에도 텍스트가 나오는 거고 어? 우리 그러면은 맞다 이런 거가 나오는 거 아니야? 아니다 근데 이거는 지금 내가 단어 인식만 시킨 모델을 적용해서 그런 거고 돌아오는 주에 이제 그 GPT 재미나이 연결해서 문장으로 보내게 할 수 있겸 그럼 백앤드의 API 한 번 더 추가해야겠지? 그럼 그것도 재석 작성 아니 자꾸 근데 좀 조금 더 조금 더 뭘 좀 열어볼까? 백앤드의 API 해야 된다는 거 아 아니야 아니야 희정이가 염교시킨단 말이야 희정이가 알아서 하는 거야? 오케이 뒤에 LLM에 우선은 그냥 염교시킨단 말이야 LLM은 내가 이미 테스트 해봤어 알겠습니다 지금 미디어 파이프랑 중간에 무대를 붙여가지고 그 결과물까지만 좀 나온 거잖아 지금 응 그래서 그 다음 주 있잖아 돌아오는지 말고 다음 주에 이제 그 붙인 거 보여줄 거야 최종 발표 전에 보여주네? 그지? 그 전에 보여줘야 되겠지? 그치 일단 오케이 이거 하고 그럼 4번까지 참여해줬잖아 4번? 다시 도션 매력으로 가면 그래서 희정아 내가 얘기한 건 어때? 일단 그 누가 누가 한 여유가 있는 사람이 있다면 하면 좋은데 솔직히 나 내 담당이지만 내 쪽에서도 지금 이따가 쓸 시간이 없다 보니까 말을 못 하겠어 내가 못 하겠어서 아니 그러면 이게 그냥 내가 하려고 물어본 건데? 그러니까 어쨌든 괜찮겠네? 재석이는 이해했어? 그러면 텍스다 두 개 해둬? 밑에도 그 인식때도 나오고 그러니까 아래는 약간 확인용이고 수어 인식이 잘 됐는지 근데 그 저... 지금은 단어로 뜨고 문장 학습을 다음 주에 시키면 여기 문장이 뜨겠건 내가 만들겠지? 근데 그거 이제 휴지기를 두고 인식시키면 됐잖아 그러면 단어를 끊어서 다 인식시키고 한 번 다에 다 전송 누르면 문장어로 바뀌고 한 번 더 해볼게 그게 내가 아직 해보진 않아서 솔직히 확실하게 말하면 못하겠지만 그 단어랑 단어 사이가 어떻게 보면 트레인 단위로 지금 비격을 따지잖아 그래서 내가 계산식을 세울 수가 있는 거야 예를 들어 뭐 4... 뭐 한 3프레임 동안 내가 좌표의 변화가 없어 그러면 이걸 휴지기라고 정의를 하고 얘를 자동으로 서브에 보낼 수 있어 근데 그렇게 했을 때 정확도나 우리가 원하는 성능이 제대로 나올지는 계속 테스트해 달겠지만 그런 식으로 이렇게 글로스토크는 서브에 자동으로 보내주고 전체 문장은 제석에 말한 것처럼 이거 멈추기 아니면은 시작하기 이걸로 보내지는 거지 잠깐만 그 멈추기 시작이 단어를 끊는 거 아니었어? 지금은 단어인데 그거를 그러면 문장을 씁힐 때 그러면 단어별로 계속 눌렀다가 눌렀다가 눌렀다가 이래야 되잖아",
  "clean_text": "현재 개발 중인 상담 대화 앱의 기능과 UI에 대해 논의했습니다. 수어 인식, 타이핑, 필담 세 가지 입력 방식을 고려하고 있으며, 특히 수어 인식 카메라 배치와 단어/문장 인식 후 전송 방식, 백엔드 API 및 LLM 연동 방안에 대해 의견을 교환했습니다. UI의 복잡성에 대한 우려도 제기되었으며, 각 기능의 구현과 담당 업무를 조율했습니다.",
  "latency_ms": {
    "stt": 265663.8,
    "nlp": 12346.2,
    "mapping": 190.1,
    "synth": 887.2,
    "total": 279087.3
  },
  "gloss": [
    "앱",
    "대화",
    "수어",
    "인식",
    "타이핑",
    "필담",
    "입력",
    "UI",
    "기능",
    "논의"
  ],
  "gloss_ids": [
    "103676",
    "101823",
    "103579",
    "104001",
    "102552",
    "103150",
    "101803"
  ],
  "sentence_video_url": "/media/sign_sentences/sent_20251123_233048.mp4",
  "sign_video_list": [
    "/media/sign_videos/103676.mp4",
    "/media/sign_videos/101823.mp4",
    "/media/sign_videos/103579.mp4",
    "/media/sign_videos/104001.mp4",
    "/media/sign_videos/102552.mp4",
    "/media/sign_videos/103150.mp4",
    "/media/sign_videos/101803.mp4"
  ],
  "gloss_labels": [
    "대화",
    "수어",
    "도장",
    "타자",
    "입",
    "기",
    "논의"
  ]
}